## Ejercicio - pandas 2

In [6]:
import numpy as np
import pandas as pd

In [7]:
# Versiones
print(f"numpy=={np.__version__}")
print(f"pandas=={pd.__version__}")

numpy==2.2.1
pandas==2.2.3

### Ejercicio 0:
- Carga el archivo **titanic.csv** y guardalo en la variable **df**.

In [8]:
df = pd.read_csv("../Data/titanic.csv")
df.head() # Mostramos las 5 primeras filas

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
0,1,"Braund, Mr. Owen Harris",male,22.0,0,3,A/5 21171,7.2500
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1,PC 17599,71.2833
2,3,"Heikkinen, Miss. Laina",female,26.0,1,3,STON/O2. 3101282,7.9250
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,1,113803,53.1000
4,5,"Allen, Mr. William Henry",male,35.0,0,3,373450,8.0500

### Ejercicio 1:
- Muestra la informaci√≥n del DataFrame.

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Name         891 non-null    object
 2   Sex          891 non-null    object
 3   Age          714 non-null    float64
 4   Survived     891 non-null    int64
 5   Pclass       891 non-null    int64
 6   Ticket       891 non-null    object
 7   Fare         891 non-null    float64
dtypes: float64(2), int64(3), object(3)
memory usage: 55.8+ KB

### Ejercicio 2:
- Cambia las columnas del tipo **"object"** a tipo **"category"**.

In [10]:
# De una en una
df['Sex'].astype('category') # Asi no se guarda

df['Sex'] = df['Sex'].astype('category') # Asi si se guarda

In [11]:
# Mas de una a la vez
df[['Sex', 'Ticket', 'Name']] = df[['Sex', 'Ticket', 'Name']].astype('category')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Name         891 non-null    category
 2   Sex          891 non-null    category
 3   Age          714 non-null    float64
 4   Survived     891 non-null    int64
 5   Pclass       891 non-null    int64
 6   Ticket       891 non-null    category
 7   Fare         891 non-null    float64
dtypes: category(3), float64(2), int64(3)
memory usage: 100.1 KB

### Ejercicio 3:
- Obten un DataFrame solo con hombres.

In [12]:
# Solo el filtro sin guardar
df["Sex"] == "Male"

# Se hace el filtro y se guarda en df_male a la vez
df_male = df[df["Sex"] == "Male"]

### Ejercicio 4:
- Obten un DataFrame con los pasajeros de clase 1 y 2.

In [13]:
df[(df["Pclass"] == 1) | (df["Pclass"] == 2)]

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1,PC 17599,71.2833
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,1,113803,53.1000
6,7,"McCarthy, Mr. Timothy J",male,54.0,0,1,17463,51.8625
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,2,237736,30.0708
11,12,"Bonnell, Miss. Elizabeth",female,58.0,1,1,113783,26.5500
...,...,...,...,...,...,...,...,...
880,881,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,1,2,230433,26.0000
883,884,"Banfield, Mr. Frederick James",male,28.0,0,2,C.A./SOTON 34068,10.5000
886,887,"Montvila, Rev. Juozas",male,27.0,0,2,211536,13.0000
887,888,"Graham, Miss. Margaret Edith",female,19.0,1,1,112053,30.0000
889,890,"Behr, Mr. Karl Howell",male,26.0,1,1,111369,30.0000

In [14]:
df[df["Pclass"].isin([1,2])] # Es lo mismo que el anterior pero en una sola linea

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1,PC 17599,71.2833
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,1,113803,53.1000
6,7,"McCarthy, Mr. Timothy J",male,54.0,0,1,17463,51.8625
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,2,237736,30.0708
11,12,"Bonnell, Miss. Elizabeth",female,58.0,1,1,113783,26.5500
...,...,...,...,...,...,...,...,...
880,881,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,1,2,230433,26.0000
883,884,"Banfield, Mr. Frederick James",male,28.0,0,2,C.A./SOTON 34068,10.5000
886,887,"Montvila, Rev. Juozas",male,27.0,0,2,211536,13.0000
887,888,"Graham, Miss. Margaret Edith",female,19.0,1,1,112053,30.0000
889,890,"Behr, Mr. Karl Howell",male,26.0,1,1,111369,30.0000

### Ejercicio 5:
- Obten un DataFrame con los pasajeros de la clase 1 y 3, menores a 30 a√±os.

In [15]:
df[(df["Pclass"].isin([1,3])) & (df["Age"] < 30) ]

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
0,1,"Braund, Mr. Owen Harris",male,22.0,0,3,A/5 21171,7.2500
2,3,"Heikkinen, Miss. Laina",female,26.0,1,3,STON/O2. 3101282,7.9250
7,8,"Palsson, Master. Gosta Leonard",male,2.0,0,3,349909,21.0750
8,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,1,3,347742,11.1333
10,11,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,3,PP 9549,16.7000
...,...,...,...,...,...,...,...,...
877,878,"Petroff, Mr. Nedelio",male,19.0,0,3,349212,7.8958
882,883,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,3,7552,10.5167
884,885,"Sutehall, Mr. Henry Jr",male,25.0,0,3,SOTON/OQ 392076,7.0500
887,888,"Graham, Miss. Margaret Edith",female,19.0,1,1,112053,30.0000
889,890,"Behr, Mr. Karl Howell",male,26.0,1,1,111369,30.0000

In [16]:
# Lo mismo que el de arriba pero desglosado
clase_1_3 = df["Pclass"].isin([1,3])
menor_30 = df["Age"] < 30
df[clase_1_3 & menor_30]

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
0,1,"Braund, Mr. Owen Harris",male,22.0,0,3,A/5 21171,7.2500
2,3,"Heikkinen, Miss. Laina",female,26.0,1,3,STON/O2. 3101282,7.9250
7,8,"Palsson, Master. Gosta Leonard",male,2.0,0,3,349909,21.0750
8,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,1,3,347742,11.1333
10,11,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,3,PP 9549,16.7000
...,...,...,...,...,...,...,...,...
877,878,"Petroff, Mr. Nedelio",male,19.0,0,3,349212,7.8958
882,883,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,3,7552,10.5167
884,885,"Sutehall, Mr. Henry Jr",male,25.0,0,3,SOTON/OQ 392076,7.0500
887,888,"Graham, Miss. Margaret Edith",female,19.0,1,1,112053,30.0000
889,890,"Behr, Mr. Karl Howell",male,26.0,1,1,111369,30.0000

### Ejercicio 6:
- Obten un DataFrame con los pasajeros entre 20 y 30 a√±os.

In [30]:
df[df["Age"].between(20, 30)]

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
0,1,"Braund, Mr. Owen Harris",male,22.0,0,3,A/5 21171,7.2500
2,3,"Heikkinen, Miss. Laina",female,26.0,1,3,STON/O2. 3101282,7.9250
8,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,1,3,347742,11.1333
12,13,"Saundercock, Mr. William Henry",male,20.0,0,3,A/5. 2151,8.0500
23,24,"Sloper, Mr. William Thompson",male,28.0,1,1,113788,35.5000
...,...,...,...,...,...,...,...,...
882,883,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,3,7552,10.5167
883,884,"Banfield, Mr. Frederick James",male,28.0,0,2,C.A./SOTON 34068,10.5000
884,885,"Sutehall, Mr. Henry Jr",male,25.0,0,3,SOTON/OQ 392076,7.0500
886,887,"Montvila, Rev. Juozas",male,27.0,0,2,211536,13.0000
889,890,"Behr, Mr. Karl Howell",male,26.0,1,1,111369,30.0000

In [18]:
df[(df["Age"].between(20, 30))].describe()

       PassengerId         Age    Survived      Pclass        Fare
count   245.000000  245.000000  245.000000  245.000000  245.000000
mean    432.624490   25.091837    0.355102    2.424490   27.101665
std     254.982444    3.134410    0.479524    0.757079   42.826678
min       1.000000   20.000000    0.000000    1.000000    0.000000
25%     222.000000   22.000000    0.000000    2.000000    7.895800
50%     404.000000   25.000000    0.000000    3.000000   10.500000
75%     650.000000   28.000000    1.000000    3.000000   26.000000
max     890.000000   30.000000    1.000000    3.000000  263.000000

### Ejercicio 7:
- Obten un DataFrame con los pasajeros menores a 25 a√±os y mayores a 50 a√±os.

In [19]:
# Usamos el filtro Between para el resultado opuesto de Between
df[~(df['Age'].between(25, 50))]

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
0,1,"Braund, Mr. Owen Harris",male,22.0,0,3,A/5 21171,7.2500
5,6,"Moran, Mr. James",male,NaN,0,3,330877,8.4583
6,7,"McCarthy, Mr. Timothy J",male,54.0,0,1,17463,51.8625
7,8,"Palsson, Master. Gosta Leonard",male,2.0,0,3,349909,21.0750
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,2,237736,30.0708
...,...,...,...,...,...,...,...,...
878,879,"Laleff, Mr. Kristo",male,NaN,0,3,349217,7.8958
879,880,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,1,1,11767,83.1583
882,883,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,3,7552,10.5167
887,888,"Graham, Miss. Margaret Edith",female,19.0,1,1,112053,30.0000
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,0,3,W./C. 6607,23.4500

### Ejercicio 8:
- Remplaza los valores de sexo, por M para male y F para female.

In [20]:
# Paso1 - Crear un diccionario de python que tenga clave M y valor male, clave F y valor female
# Las claves a mapear deben coincidir exactamentye con valor que ya exista en la columna
genero_dic = {
    "male" : "M",
    "female" : "F"
}
# Paso2 - Pasar el diccionario como parametro de la funcion .map sobre la columna genero
# df['Sex'] = df['Sex'].map(genero_dic) Asi se guarda
df['Sex'].map(genero_dic) # Asi no se guarda
# Si hay algun NaN es porque co coincide con lo que esta escrito en la columna

0      M
1      F
2      F
3      F
4      M
      ..
886    M
887    F
888    F
889    M
890    M
Name: Sex, Length: 891, dtype: category
Categories (2, object): ['F', 'M']

### Ejercicio 9:
- Convierte en mayusculas todos los nombres de los pasajeros.

In [21]:
# Con la funcion Apply, recibe una funcion def o una funcion lamba
def con_mayu(text):
    return text.upper()
df['Name'].apply(con_mayu)

0                                BRAUND, MR. OWEN HARRIS
1      CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...
2                                 HEIKKINEN, MISS. LAINA
3           FUTRELLE, MRS. JACQUES HEATH (LILY MAY PEEL)
4                               ALLEN, MR. WILLIAM HENRY
                             ...
886                                MONTVILA, REV. JUOZAS
887                         GRAHAM, MISS. MARGARET EDITH
888             JOHNSTON, MISS. CATHERINE HELEN "CARRIE"
889                                BEHR, MR. KARL HOWELL
890                                  DOOLEY, MR. PATRICK
Name: Name, Length: 891, dtype: category
Categories (891, object): ['ABBING, MR. ANTHONY', 'ABBOTT, MR. ROSSMORE EDWARD', 'ABBOTT, MRS. STANTON (ROSA HUNT)', 'ABELSON, MR. SAMUEL', ..., 'DE PELSMAEKER, MR. ALFONS', 'DEL CARLO, MR. SEBASTIANO', 'VAN BILLIARD, MR. AUSTIN BLYLER', 'VAN MELKEBEKE, MR. PHILEMON']

In [22]:
# Con una lambda cuando la transformacio requiere poco codigo
df['Name'].apply(lambda name: name.upper())

0                                BRAUND, MR. OWEN HARRIS
1      CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...
2                                 HEIKKINEN, MISS. LAINA
3           FUTRELLE, MRS. JACQUES HEATH (LILY MAY PEEL)
4                               ALLEN, MR. WILLIAM HENRY
                             ...
886                                MONTVILA, REV. JUOZAS
887                         GRAHAM, MISS. MARGARET EDITH
888             JOHNSTON, MISS. CATHERINE HELEN "CARRIE"
889                                BEHR, MR. KARL HOWELL
890                                  DOOLEY, MR. PATRICK
Name: Name, Length: 891, dtype: category
Categories (891, object): ['ABBING, MR. ANTHONY', 'ABBOTT, MR. ROSSMORE EDWARD', 'ABBOTT, MRS. STANTON (ROSA HUNT)', 'ABELSON, MR. SAMUEL', ..., 'DE PELSMAEKER, MR. ALFONS', 'DEL CARLO, MR. SEBASTIANO', 'VAN BILLIARD, MR. AUSTIN BLYLER', 'VAN MELKEBEKE, MR. PHILEMON']

In [23]:
# Otra version mas reducida
df['Name'].apply(str.upper)

0                                BRAUND, MR. OWEN HARRIS
1      CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...
2                                 HEIKKINEN, MISS. LAINA
3           FUTRELLE, MRS. JACQUES HEATH (LILY MAY PEEL)
4                               ALLEN, MR. WILLIAM HENRY
                             ...
886                                MONTVILA, REV. JUOZAS
887                         GRAHAM, MISS. MARGARET EDITH
888             JOHNSTON, MISS. CATHERINE HELEN "CARRIE"
889                                BEHR, MR. KARL HOWELL
890                                  DOOLEY, MR. PATRICK
Name: Name, Length: 891, dtype: category
Categories (891, object): ['ABBING, MR. ANTHONY', 'ABBOTT, MR. ROSSMORE EDWARD', 'ABBOTT, MRS. STANTON (ROSA HUNT)', 'ABELSON, MR. SAMUEL', ..., 'DE PELSMAEKER, MR. ALFONS', 'DEL CARLO, MR. SEBASTIANO', 'VAN BILLIARD, MR. AUSTIN BLYLER', 'VAN MELKEBEKE, MR. PHILEMON']

In [24]:
# Value counts
df['Sex'].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [25]:
nulos = df['Age'].isnull()
df[nulos]

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
5,6,"Moran, Mr. James",male,NaN,0,3,330877,8.4583
17,18,"Williams, Mr. Charles Eugene",male,NaN,1,2,244373,13.0000
19,20,"Masselmani, Mrs. Fatima",female,NaN,1,3,2649,7.2250
26,27,"Emir, Mr. Farred Chehab",male,NaN,0,3,2631,7.2250
28,29,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,1,3,330959,7.8792
...,...,...,...,...,...,...,...,...
859,860,"Razi, Mr. Raihed",male,NaN,0,3,2629,7.2292
863,864,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,0,3,CA. 2343,69.5500
868,869,"van Melkebeke, Mr. Philemon",male,NaN,0,3,345777,9.5000
878,879,"Laleff, Mr. Kristo",male,NaN,0,3,349217,7.8958
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,0,3,W./C. 6607,23.4500

In [26]:
df.isnull().sum() # Suma los NaN de cada columna y muestra la suma

PassengerId      0
Name             0
Sex              0
Age            177
Survived         0
Pclass           0
Ticket           0
Fare             0
dtype: int64

In [27]:
df.isnull().sum()*100/df.shape[0] # Porcentaje de nulos

PassengerId     0.00000
Name            0.00000
Sex             0.00000
Age            19.86532
Survived        0.00000
Pclass          0.00000
Ticket          0.00000
Fare            0.00000
dtype: float64

In [28]:
# Rellenar nulos numericos con la mediana
df['Age'].fillna(df['Age'].median())

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    28.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [29]:
################################################################################################################################